<template>
  <el-dialog :lock-scroll="false" title="腾讯薪管家产品服务协议" :visible.sync="showDialog1" @close="closeDialog" width="100%" style="overflow: hidden;">
    <div class="dialog-body-box">
      <p class="p-font-bold">
        欢迎你使用腾讯薪管家服务！
      </p>
      <p class="p-font-bold">
        为使用腾讯薪管家服务，你应当阅读并遵守《腾讯薪管家服务协议》（以下简称“本协议”）。本协议由你与深圳市腾讯计算机系统有限公司（以下简称“腾讯”或“我们”）签订，对你注册、使用腾讯薪管家服务（以下亦可简称“本服务”）过程中的各方权利义务等具体内容进行约定。
      </p>
      <p class="p-font-bold">
        我们在此特别提醒你认真阅读、充分理解本协议各条款，特别是你同意及授权的条款、争议解决和法律适用等条款。为提醒你注意，我们已对这些条款予以加粗以特别提醒你加以注意，请你仔细阅读并自主决定接受或不接受。你使用腾讯薪管家服务的行为（包括在我们合作的第三方产品及业务中使用腾讯薪管家服务）即视为你已阅读、知悉、理解和完全同意本协议的约定。
      </p>
      <p class="p-font-bold" style="text-decoration: underline;">
        我们特别提示你，你点击“已阅读并同意《腾讯薪管家服务协议》”或点击按钮“同意”的行为视为你已经充分阅读并理解、同意本协议的内容并作出相关授权。
      </p>
      <p>
        如果你在阅读本协议过程中有任何问题，请你联系我们，我们将对相关内容进行解释和说明，以使你能够充分理解并自主判断和决定是否接受本协议内容。
      </p>
      <p class="p-font-bold" style="padding: 2vh 0 0 0;">
        一、服务内容
      </p>
      <p>
        1.1 腾讯薪管家服务由以下服务和功能组成：
      </p>
      <p>
        （1）腾讯为你所在的企业提供的员工薪资银行卡信息管理、薪资信息分发及通知等服务；
      </p>
      <p>
        （2）腾讯根据你所在企业的需求为你提供的薪资银行卡绑定、管理等功能（即“薪资卡”）；
      </p>
      <p>
        （3）腾讯根据你所在企业提供的信息为你提供个人薪资信息及查询等功能（即“薪资明细”）；
      </p>
      <p>
        （4）通过腾讯与银行系统对接以及腾讯为银行提供的技术服务，你可使用银行的II类银行账户开户、信贷、理财等金融服务；
      </p>
      <p>
        （5）通过腾讯与理财通系统的对接，你可使用理财通平台上的服务；
      </p>
      <p>
        （6）其他腾讯薪管家不时更新提供的服务或功能。
      </p>
      <p>
        1.2 薪管家上的“薪资理财”对接理财通，相关理财产品由理财通合作的金融机构提供；薪管家上九宫格（即 “某银行服务”）的金融服务由腾讯合作的银行提供，具体的银行根据腾讯的业务情况以及你的企业选择确定。
      </p>
      <p>
        1.3 对于你通过腾讯薪管家服务并选择使用银行或其他第三方提供的服务时，应充分了解银行或其他第三方服务的产品功能及隐私保护政策，遵守与银行或其他第三方达成的相关服务协议的约定。
      </p>
      <p class="p-font-bold">
        二、服务使用规则
      </p>
      <p>
        2.1 你使用腾讯薪管家服务的基本前提是，你所在的企业已经开通腾讯薪管家服务，并且你通过你所在企业的企业微信开通腾讯薪管家服务。
      </p>
      <p>
        2.2 你需要通过绑定你的银行卡作为你的薪资卡，方可使用薪管家的各项服务和功能。另外，银行可能会要求你同时开通II类银行账户作为薪资理财账户（我们为此提供技术服务），你需要按照银行的提示提交你的身份证号码与身份证影印件、银行卡信息、手机号等个人信息并对你的人脸进行认证。
      </p>
      <p>
        2.3 你应当保证你所提供的个人信息的真实性、合法性、完整性、准确性和有效性。否则，你可能无法使用腾讯薪管家服务。
      </p>
      <p>
        2.4 你应以你本人的真实身份信息使用腾讯薪管家服务，你保证由你本人注册、开通腾讯薪管家服务，你保证由你本人进行操作，并不向其他任何人披露、泄露或出借前述信息和设备，亦不使用其他任何人的该等信息和设备。你应妥善保管你的手机设备、账号、密码以及动态验证码等资料，并对该账号项下所从事的行为承担相应的法律责任。
      </p>
      <p>
        2.5 使用腾讯薪管家服务过程中，如果你的个人信息有更新，你应及时进行更新。否则，因此产生的法律责任由你承担。
      </p>
      <p>
        2.6 如果你的企业微信账户、终端设备因信息泄露、遗失或被非授权使用所致的损失由你自行承担。
      </p>
      <p class="p-font-bold">
        三、合法使用承诺
      </p>
      <p class="p-font-bold">
        3.1 你需要遵守中华人民共和国相关法律法规，不得将我们的服务用于非法目的，也不得以非法方式使用我们的服务。
      </p>
      <p class="p-font-bold">
        3.2 你不得利用本服务实施任何违反国家法律、法规、规章及规范性文件的行为，不得侵犯其他任何第三人的合法权益，尤其不得利用本服务实施欺诈等违法行为。
      </p>
      <p class="p-font-bold">
        四、服务注意事项
      </p>
      <p>
        4.1 腾讯将根据你所在企业的情况以及你的申请情况，决定是否为你提供腾讯薪管家服务。
      </p>
      <p>
        4.2 你通过薪管家获取的薪资明细信息将会由你所在公司根据相关规则生成，腾讯并不对薪资明细的具体内容负责。
      </p>
      <p>
        4.3 为了向你提供更优的服务，腾讯有权对腾讯薪管家服务系统进行升级、改造。
      </p>
      <p>
        4.4 你在使用本服务过程中，如果还涉及到使用腾讯其他服务的，你应当同时遵守腾讯其他服务的规定或规则。
      </p>
      <p class="p-font-bold">
        4.5 如你存在不遵守本协议或腾讯相关业务规定、恶意操作或利用腾讯薪管家服务从事违反国家法律法规活动或损害其他第三方合法权益的，腾讯有权单方终止对你提供腾讯薪管家服务，并要求你赔偿腾讯因此造成的损失。
      </p>
      <p class="p-font-bold">
        4.6 如果你与银行或其他第三方之间因具体服务内容发生的争议或纠纷，由你与你银行或其他第三方协商处理，我们不介入你与银行或其他第三方的交易，我们不对银行或其他第三方的服务承担法律责任。但我们在此承诺，为了保护你的合法权益，我们将向你提供必要协助。
      </p>
      <p class="p-font-bold">
        五、用户个人信息保护
      </p>
      <p>
        5.1 保护用户个人信息是我们的一项基本原则，我们将会采取合理的措施保护用户的个人信息，并按照
        <span class="p-font-bold">《企业微信隐私保护指引》</span>的规定保护你的隐私。
      </p>
      <p class="p-font-bold">
        5.2 你在开通并使用本服务的过程中，你需要按照页面的提示提交相关个人信息，或者你所在的企业向我们提交服务所需的信息，或者基于反洗钱之目的，你开通服务的银行需要收集你的信息，你同意并授权我们收集并处理。否则，你无法注册使用本服务或在使用的服务或功能将受到限制。
      </p>
      <p>
        5.3 一般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，你可能无法修改开通时提供的初始信息及其他验证信息。
      </p>
      <p>
        5.4 腾讯将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授权的访问、使用或披露。
      </p>
      <p>
        5.5 鉴于腾讯薪管家服务与个人信息采集、处理的高度关联性以及不可分割性，为了充分保护你的合法权益，我们会过单独的
        <span class="p-font-bold">《个人信息授权协议》</span>与你就个人信息采集、处理作出约定、取得你的特别授权，请你仔细阅读、理解。
      </p>
      <p class="p-font-bold">
        六、不可抗力与免责事项
      </p>
      <p class="p-font-bold">
        6.1 你理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为以及政策法律等规定变化等。出现上述情况时，我们将努力在第一时间与相关单位配合，尽量降低各方损失。
      </p>
      <p class="p-font-bold">
        6.2 在法律允许的范围内，腾讯对以下情形导致的本服务中断或受阻不承担责任：
      </p>
      <p class="p-font-bold">
        （1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
      </p>
      <p class="p-font-bold">
        （2）网络故障、网络异常；
      </p>
      <p class="p-font-bold">
        （3）你操作不当；
      </p>
      <p class="p-font-bold">
        （4）你按未经我们授权的方式使用本服务；
      </p>
      <p class="p-font-bold">
        （5）其他腾讯无法控制或合理预见的情形。
      </p>
      <p class="p-font-bold">
        七、法律适用与争议解决
      </p>
      <p class="p-font-bold">
        7.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法规则）。
      </p>
      <p class="p-font-bold">
        7.2 若你和腾讯之间发生任何纠纷或争议，首先应友好协商解决；若协商不成的，你和腾讯同意将纠纷或争议提交本协议签订地有管辖权的人民法院，过诉讼加以解决。
      </p>
      <p class="p-font-bold">
        7.3 本协议签订地为中华人民共和国广东省深圳市南山区。
      </p>
      <p class="p-font-bold">
        八、其他事项
      </p>
      <p>
        8.1 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
      </p>
      <p class="p-font-bold">
        8.2 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      </p>
      <p>
        8.3 《个人信息授权协议》及其他规则、公告作为本协议不可分割的组成部分，与本协议具有同等法律效力。
      </p>
    </div>
  </el-dialog>
</template>
<script>
export default {
  name: 'ProtocolProductDialog',
  props: {
    value: {
      type: Boolean,
      default: false
    }
  },
  data () {
    return {
      showDialog1: false
    }
  },
  watch: {
    value: {
      handler: function (val) {
        this.showDialog1 = val
      }
    }
  },
  methods: {
    closeDialog () {
      this.$emit('closeDialog1')
    }
  }
}
</script>
<style>
</style>
<style scoped>
.dialog-body-box p {
  margin: 0 0;
  padding: 1vw 0 0 0;
}
.p-font-bold {
  font-weight: bold;
  color: black;
}
div >>> .el-dialog {
  background-color: inherit;
  border-radius: 6px;
  margin-top: 10vh !important;
}
div >>> .el-dialog__header {
  background-color: #ffffff;
  padding: 2vh 0;
  border-radius: 6px 6px 0 0;
  border-bottom: solid 1px #bbbbbb;
}
div >>> .el-dialog__headerbtn {
  top: 2vh;
  line-height: 26px;
}
div >>> .el-dialog__body {
  font-size: 3.2vw;
  text-align: left;
  line-height: 1.6;
  letter-spacing: 1.2px;
  padding: 2vh 4vw 3vh 4vw;
  border-radius: 0 0 6px 6px;
  background-color: #ffffff;
  overflow: scroll;
  height: 65vh;
}
div >>> .el-dialog__title {
  color: #000000;
  font-size: 4vw;
  font-family: PingFang-SC-Medium;
  font-weight: bold;
  height: 6vw;
}
div >>> .el-dialog__close:before {
  color: #000;
  font-size: 5vw;
}
</style>
